Repository: Mylenela/old.mylenela.fr
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: English
fr: Anglais

source: French
fr: Français

source: Oups... This page doesn't exist
fr: Oups... Cette page n'existe pas

source: Let's go the homepage
fr: Retour sur la page d'accueil

source: here
fr: ici

source: Oups the servor is not happy right now !
fr: Oups, le serveur n'est pas très heureux en ce moment !

source: Please try to reload a bit later
fr: Rechargez la page dans quelques instants

source: Contact me here !
fr: Contactez moi ici :

source: Home
fr: Accueil

source: Graphic Designer &amp; Illustrator<br>from Earth
fr: Je suis Designer graphique <br>&amp; Illustratrice

source: I'm a Graphic Designer &amp; Illustrator from Nantes, France. I cleverly combine design, creativity <br>and interactivity
fr: Je mêle astucieusement design, creativité,<br>et fonctionnalité.

source: Selected Works
fr: Sélections

source: All
fr: Tout

source: Mylenela - Graphic Design Illustration Datavisualisation
fr: Mylenela - Graphic Design Illustration Datavisualisation Nantes

source: I'm a graphic designer from France. I work on many kind of projects, like webdesign, print, datavisualisation, logos, illustration. I'm available for Freelance work.
fr: Je suis une graphiste et webdesigner vivant à Nantes, France. Je travaille pour tout type de projet comme le webdesign, l'édition, la datavisualisation, l'illustration... Je suis disponible pour des contrats freelance.

source: mylenela, mylène larnaud, graphic designer, french graphic designer, french, nantes, webdesign, illustration, datavisualisation
fr: mylenela, graphisme, designer graphique, print, édition, 44, datavisualisation, illustration, illustratrice, webdesign, nantes, 44000, loire-atlantique, design application, logo, création site internet, mylène larnaud

source: Selected Work
fr: Sélections
